Ran Plan for project: `aws-dev` dir: `aws` workspace: `filecoin-glif-dev-apn1`

<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/tls from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Using previously-installed hashicorp/kubernetes v2.13.1
- Using previously-installed hashicorp/helm v2.6.0
- Using previously-installed hashicorp/tls v4.0.2
- Using previously-installed hashicorp/local v2.2.3
- Using previously-installed hashicorp/aws v4.33.0
- Using previously-installed hashicorp/random v3.4.3

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "filecoin-glif-dev-apn1".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret.creds_atlantis will be created
+ resource "aws_secretsmanager_secret" "creds_atlantis" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "filecoin-dev-apn1-glif/creds-atlantis"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "Environment"     = "dev"
          + "Name"            = "filecoin-dev-apn1-glif-creds-atlantis"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }
      + tags_all                       = {
          + "Environment"     = "dev"
          + "Name"            = "filecoin-dev-apn1-glif-creds-atlantis"
          + "Project"         = "Filecoin"
          + "ProvisionedWith" = "Terraform"
          + "Sub_environment" = "glif"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].aws_codebuild_project.codebuild will be destroyed
  # (because aws_codebuild_project.codebuild is not in configuration)
- resource "aws_codebuild_project" "codebuild" {
      - arn                    = "arn:aws:codebuild:ap-northeast-1:499623857295:project/filecoin-dev-apn1-glif-hyperspace-codebuild-deploy" -> null
      - badge_enabled          = true -> null
      - badge_url              = "https://codebuild.ap-northeast-1.amazonaws.com/badges?uuid=eyJlbmNyeXB0ZWREYXRhIjoia0sxQTU4M2Q1YXBhY0tkaUEzMTkvcXpSdEpHL1MxdmlsOFNNaXltY1czOVNMU3dDTzlIY0pLNW04V2ZReXFOVGsva3NlM2hxOHhhYlRNUUtqZ3ZVZzlZPSIsIml2UGFyYW1ldGVyU3BlYyI6Ijc1V1IvL3BoakhhMjZNM0YiLCJtYXRlcmlhbFNldFNlcmlhbCI6MX0%3D&branch=main" -> null
      - build_timeout          = 40 -> null
      - concurrent_build_limit = 10 -> null
      - description            = "CI/CD pipeline for a filecoin hyperspace application-deploy" -> null
      - encryption_key         = "arn:aws:kms:ap-northeast-1:499623857295:alias/aws/s3" -> null
      - id                     = "arn:aws:codebuild:ap-northeast-1:499623857295:project/filecoin-dev-apn1-glif-hyperspace-codebuild-deploy" -> null
      - name                   = "filecoin-dev-apn1-glif-hyperspace-codebuild-deploy" -> null
      - project_visibility     = "PRIVATE" -> null
      - queued_timeout         = 480 -> null
      - service_role           = "arn:aws:iam::499623857295:role/filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - source_version         = "ntwk/hyperspace" -> null
      - tags                   = {
          - "Environment"     = "dev"
          - "Project"         = "Filecoin"
          - "ProvisionedWith" = "Terraform"
          - "Sub_environment" = "glif"
        } -> null
      - tags_all               = {
          - "Environment"     = "dev"
          - "Project"         = "Filecoin"
          - "ProvisionedWith" = "Terraform"
          - "Sub_environment" = "glif"
        } -> null

      - artifacts {
          - encryption_disabled    = false -> null
          - override_artifact_name = false -> null
          - type                   = "NO_ARTIFACTS" -> null
        }

      - cache {
          - modes = [] -> null
          - type  = "NO_CACHE" -> null
        }

      - environment {
          - compute_type                = "BUILD_GENERAL1_2XLARGE" -> null
          - image                       = "aws/codebuild/amazonlinux2-x86_64-standard:4.0" -> null
          - image_pull_credentials_type = "CODEBUILD" -> null
          - privileged_mode             = true -> null
          - type                        = "LINUX_CONTAINER" -> null

          - environment_variable {
              - name  = "AWS_ACCOUNT_ID" -> null
              - type  = "PLAINTEXT" -> null
              - value = "499623857295" -> null
            }
          - environment_variable {
              - name  = "ENVIRONMENT" -> null
              - type  = "PLAINTEXT" -> null
              - value = "dev" -> null
            }
          - environment_variable {
              - name  = "IS_BUILD_ONLY" -> null
              - type  = "PLAINTEXT" -> null
              - value = "0" -> null
            }
          - environment_variable {
              - name  = "PROJECT" -> null
              - type  = "PLAINTEXT" -> null
              - value = "filecoin" -> null
            }
          - environment_variable {
              - name  = "REGION" -> null
              - type  = "PLAINTEXT" -> null
              - value = "ap-northeast-1" -> null
            }
          - environment_variable {
              - name  = "REGION_SHORT" -> null
              - type  = "PLAINTEXT" -> null
              - value = "apn1" -> null
            }
          - environment_variable {
              - name  = "SUB_ENVIRONMENT" -> null
              - type  = "PLAINTEXT" -> null
              - value = "glif" -> null
            }
        }

      - logs_config {
          - cloudwatch_logs {
              - status = "ENABLED" -> null
            }

          - s3_logs {
              - encryption_disabled = false -> null
              - status              = "DISABLED" -> null
            }
        }

      - secondary_source_version {
          - source_identifier = "SECOND" -> null
          - source_version    = "feature/multi-arch" -> null
        }

      - secondary_sources {
          - git_clone_depth     = 1 -> null
          - insecure_ssl        = false -> null
          - location            = "https://github.com/glifio/filecoin-docker.git" -> null
          - report_build_status = false -> null
          - source_identifier   = "SECOND" -> null
          - type                = "GITHUB" -> null
        }

      - source {
          - buildspec           = <<-EOT
                # Do not change version. This is the version of aws buildspec, not the version of your buildspec file.
                version: 0.2
                
                env:
                  variables:
                    IMAGE_NAME: 'hyperspace'
                    IMAGE_NETWORK: 'hyperspacenet'
                    CUSTOM_TAG: 'v1.20.0-hyperspace-0201'
                    PROJECT: 'filecoin'
                    ENVIRONMENT: 'mainnet'
                    SUB_ENV: 'glif'
                    SHORT_REGION: 'apn1'
                    AWS_ACCOUNT_ID: '499623857295'
                    DOCKERUHUB_ORGANIZATION: 'glif'
                    KUBECTL_VERSION: 1.24.7
                    KUBECTL_ARCH: 'amd64'
                    DOCKER_BUILDX_VERSION: 'v0.10.3'
                    DOCKER_BUILDX_ARCH: 'linux-amd64 '
                  secrets-manager:
                    DOCKERHUB_USERNAME: "filecoin-mainnet-apn1-glif-dockerhub-glifio:username"
                    DOCKERHUB_PASS: "filecoin-mainnet-apn1-glif-dockerhub-glifio:password"
                    AWS_ACCESS_KEY_ID: "filecoin-mainnet-apn1-glif-codebuild-wallaby-user:AWS_ACCESS_KEY_ID"
                    AWS_SECRET_ACCESS_KEY: "filecoin-mainnet-apn1-glif-codebuild-wallaby-user:AWS_SECRET_ACCESS_KEY"
                
                phases:
                  install:
                    commands:
                      - echo Environment Variables
                      - printenv
                      - curl -o kubectl https://s3.us-west-2.amazonaws.com/amazon-eks/${KUBECTL_VERSION}/2022-10-31/bin/linux/${KUBECTL_ARCH}/kubectl
                      - chmod +x ./kubectl
                      - mv kubectl /usr/bin/
                      - aws eks --region $AWS_REGION update-kubeconfig --name $PROJECT-$ENVIRONMENT-$SHORT_REGION-$SUB_ENV-eks
                
                  pre_build:
                    commands:
                      - echo Build STARTED
                      - docker login --username $DOCKERHUB_USERNAME --password $DOCKERHUB_PASS
                      #
                      - echo Install buildx plugin...
                      - curl -JLO https://github.com/docker/buildx/releases/download/${DOCKER_BUILDX_VERSION}/buildx-${DOCKER_BUILDX_VERSION}.${DOCKER_BUILDX_ARCH}
                      - mkdir -p ~/.docker/cli-plugins
                      - mv buildx-${DOCKER_BUILDX_VERSION}.${DOCKER_BUILDX_ARCH} ~/.docker/cli-plugins/docker-buildx
                      - chmod a+rx ~/.docker/cli-plugins/docker-buildx
                      #
                      - echo Install binfmt tool...
                      - docker run --privileged --rm tonistiigi/binfmt --install all
                      #
                      - echo Install QEMU and binfmt_misc tools...
                      - docker run --rm --privileged multiarch/qemu-user-static --reset -p yes
                      #
                      - echo Configure Docker buildx builder...
                      - docker buildx create --use --name lotus
                      - docker buildx inspect --bootstrap
                
                  build:
                    commands:
                      - echo Image built
                      - cd ../../glifio/filecoin-docker/
                      - docker buildx build --push --platform linux/amd64,linux/arm64 --build-arg NETWORK=$IMAGE_NETWORK --build-arg BRANCH=$CUSTOM_TAG -t $DOCKERUHUB_ORGANIZATION/lotus:hyperspace-multiarch .
            EOT -> null
          - git_clone_depth     = 1 -> null
          - insecure_ssl        = false -> null
          - location            = "https://github.com/filecoin-project/lotus.git" -> null
          - report_build_status = false -> null
          - type                = "GITHUB" -> null
        }
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].aws_codebuild_source_credential.token will be destroyed
  # (because aws_codebuild_source_credential.token is not in configuration)
- resource "aws_codebuild_source_credential" "token" {
      - arn         = "arn:aws:codebuild:ap-northeast-1:499623857295:token/github" -> null
      - auth_type   = "PERSONAL_ACCESS_TOKEN" -> null
      - id          = "arn:aws:codebuild:ap-northeast-1:499623857295:token/github" -> null
      - server_type = "GITHUB" -> null
      - token       = (sensitive value)
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].aws_iam_policy.codebuild_policy will be destroyed
  # (because aws_iam_policy.codebuild_policy is not in configuration)
- resource "aws_iam_policy" "codebuild_policy" {
      - arn       = "arn:aws:iam::499623857295:policy/filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - id        = "arn:aws:iam::499623857295:policy/filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - name      = "filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:*",
                          - "ssm:*",
                          - "logs:*",
                          - "kms:*",
                          - "codeartifact:GetAuthorizationToken",
                          - "codeartifact:GetRepositoryEndpoint",
                          - "codeartifact:ReadFromRepository",
                          - "sts:GetServiceBearerToken",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAXIU7HBSHXSBI4JRUP" -> null
      - tags      = {
          - "Environment"     = "dev"
          - "Project"         = "Filecoin"
          - "ProvisionedWith" = "Terraform"
          - "Sub_environment" = "glif"
        } -> null
      - tags_all  = {
          - "Environment"     = "dev"
          - "Project"         = "Filecoin"
          - "ProvisionedWith" = "Terraform"
          - "Sub_environment" = "glif"
        } -> null
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].aws_iam_role.codebuild_role will be destroyed
  # (because aws_iam_role.codebuild_role is not in configuration)
- resource "aws_iam_role" "codebuild_role" {
      - arn                   = "arn:aws:iam::499623857295:role/filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-02-24T09:20:05Z" -> null
      - force_detach_policies = false -> null
      - id                    = "filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::499623857295:policy/filecoin-dev-apn1-glif-1rog8-codebuild-general",
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment"     = "dev"
          - "Project"         = "Filecoin"
          - "ProvisionedWith" = "Terraform"
          - "Sub_environment" = "glif"
        } -> null
      - tags_all              = {
          - "Environment"     = "dev"
          - "Project"         = "Filecoin"
          - "ProvisionedWith" = "Terraform"
          - "Sub_environment" = "glif"
        } -> null
      - unique_id             = "AROAXIU7HBSHTRGBXCZEB" -> null
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].aws_iam_role_policy_attachment.codebuild_role-ecr-policy-attachment will be destroyed
  # (because aws_iam_role_policy_attachment.codebuild_role-ecr-policy-attachment is not in configuration)
- resource "aws_iam_role_policy_attachment" "codebuild_role-ecr-policy-attachment" {
      - id         = "filecoin-dev-apn1-glif-1rog8-codebuild-general-20230224092007352800000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess" -> null
      - role       = "filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].aws_iam_role_policy_attachment.codebuild_role-policy-attachment will be destroyed
  # (because aws_iam_role_policy_attachment.codebuild_role-policy-attachment is not in configuration)
- resource "aws_iam_role_policy_attachment" "codebuild_role-policy-attachment" {
      - id         = "filecoin-dev-apn1-glif-1rog8-codebuild-general-20230224092007358000000002" -> null
      - policy_arn = "arn:aws:iam::499623857295:policy/filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
      - role       = "filecoin-dev-apn1-glif-1rog8-codebuild-general" -> null
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].random_string.uid will be destroyed
  # (because random_string.uid is not in configuration)
- resource "random_string" "uid" {
      - id          = "1rog8" -> null
      - length      = 5 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "1rog8" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.codebuild_multirepository_cd_hyperspace_dev[0].module.generator.random_string.uid will be destroyed
  # (because random_string.uid is not in configuration)
- resource "random_string" "uid" {
      - id          = "ftqc10vs" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "ftqc10vs" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 1 to add, 0 to change, 8 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p aws-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=glifio%252Ffilecoin-iac%252Faws%252Ffilecoin-glif-dev-apn1)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p aws-dev`
</details>
Plan: 1 to add, 0 to change, 8 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
